{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 320, 320, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_23", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_32", "inbound_nodes": [[["lambda_23", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_24", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_27", "inbound_nodes": [[["lambda_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_33", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_25", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_28", "inbound_nodes": [[["lambda_25", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_34", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_26", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_29", "inbound_nodes": [[["lambda_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_35", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_27", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_30", "inbound_nodes": [[["lambda_27", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_36", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_28", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_31", "inbound_nodes": [[["lambda_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_37", "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_29", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_32", "inbound_nodes": [[["lambda_29", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_6", "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_38", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_30", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_33", "inbound_nodes": [[["lambda_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_39", "inbound_nodes": [[["activation_33", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_31", "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_34", "inbound_nodes": [[["lambda_31", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_7", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_40", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_40", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_32", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_35", "inbound_nodes": [[["lambda_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_41", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_41", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_33", "inbound_nodes": [[["conv2d_41", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["lambda_33", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_4", "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_42", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_42", "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_43", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["conv2d_42", 0, 0, {}], ["conv2d_43", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_37", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_44", "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_38", "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "name": "multiply_4", "inbound_nodes": [[["activation_34", 0, 0, {}], ["activation_38", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkA2QEjQJTACkFTukA\nAAAA6QEAAADpAwAAACkB2gRheGlzKQLaAUvaC2NvbmNhdGVuYXRlKQHaAXipAHIIAAAA+h48aXB5\ndGhvbi1pbnB1dC0zLTc4ZGUyNjIwNGQ3Zj7aCDxsYW1iZGE+UQAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_34", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["multiply_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_45", "inbound_nodes": [[["lambda_34", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_35", "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_39", "inbound_nodes": [[["lambda_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_46", "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_36", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_36", "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_40", "inbound_nodes": [[["lambda_36", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_5", "inbound_nodes": [[["activation_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_47", "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_48", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["conv2d_47", 0, 0, {}], ["conv2d_48", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_41", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_49", "inbound_nodes": [[["activation_41", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_42", "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true, "dtype": "float32"}, "name": "multiply_5", "inbound_nodes": [[["activation_32", 0, 0, {}], ["activation_42", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_37", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkA2QEjQJTACkFTukA\nAAAA6QEAAADpAwAAACkB2gRheGlzKQLaAUvaC2NvbmNhdGVuYXRlKQHaAXipAHIIAAAA+h48aXB5\ndGhvbi1pbnB1dC0zLTc4ZGUyNjIwNGQ3Zj7aCDxsYW1iZGE+UQAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_37", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}], ["multiply_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_50", "inbound_nodes": [[["lambda_37", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_38", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_38", "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_43", "inbound_nodes": [[["lambda_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_51", "inbound_nodes": [[["activation_43", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_39", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_39", "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_44", "inbound_nodes": [[["lambda_39", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_6", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_6", "inbound_nodes": [[["activation_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_52", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_53", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_53", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["conv2d_52", 0, 0, {}], ["conv2d_53", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_45", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_54", "inbound_nodes": [[["activation_45", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_46", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true, "dtype": "float32"}, "name": "multiply_6", "inbound_nodes": [[["activation_30", 0, 0, {}], ["activation_46", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_40", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkA2QEjQJTACkFTukA\nAAAA6QEAAADpAwAAACkB2gRheGlzKQLaAUvaC2NvbmNhdGVuYXRlKQHaAXipAHIIAAAA+h48aXB5\ndGhvbi1pbnB1dC0zLTc4ZGUyNjIwNGQ3Zj7aCDxsYW1iZGE+UQAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_40", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}], ["multiply_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_55", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_55", "inbound_nodes": [[["lambda_40", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_41", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_41", "inbound_nodes": [[["conv2d_55", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_47", "inbound_nodes": [[["lambda_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_56", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_56", "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_42", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_42", "inbound_nodes": [[["conv2d_56", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_48", "inbound_nodes": [[["lambda_42", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_7", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_7", "inbound_nodes": [[["activation_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_57", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_57", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_58", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_58", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["conv2d_57", 0, 0, {}], ["conv2d_58", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_49", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_59", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_59", "inbound_nodes": [[["activation_49", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_50", "inbound_nodes": [[["conv2d_59", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true, "dtype": "float32"}, "name": "multiply_7", "inbound_nodes": [[["activation_28", 0, 0, {}], ["activation_50", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_43", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkA2QEjQJTACkFTukA\nAAAA6QEAAADpAwAAACkB2gRheGlzKQLaAUvaC2NvbmNhdGVuYXRlKQHaAXipAHIIAAAA+h48aXB5\ndGhvbi1pbnB1dC0zLTc4ZGUyNjIwNGQ3Zj7aCDxsYW1iZGE+UQAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_43", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}], ["multiply_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_60", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_60", "inbound_nodes": [[["lambda_43", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_44", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_44", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_51", "inbound_nodes": [[["lambda_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_61", "inbound_nodes": [[["activation_51", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_45", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczgAAABkAX0BdABqAXwAZAZkBGQFjQN9AnQAagJ8AGQHZARk\nBY0DfQN8AHwCGAB8A3wBFwAbAH0EfARTACkI+jlQZXJmb3JtcyBwZXItY2hhbm5lbCBzcGF0aWFs\nIG1lYW4tdmFyaWFuY2Ugbm9ybWFsaXphdGlvbi5nje21oPfGsD7pAQAAAOkCAAAAVCkC2gRheGlz\n2ghrZWVwZGltcykCcgIAAAByAwAAACkCcgIAAAByAwAAACkD2gFL2gRtZWFu2gNzdGQpBdoGdGVu\nc29y2gdlcHNpbG9ucgcAAAByCAAAANoDbXZuqQByDAAAAPoePGlweXRob24taW5wdXQtMy03OGRl\nMjYyMDRkN2Y+cgsAAAABAAAAcwoAAAAAAgQBEAEQARAC\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_45", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_52", "inbound_nodes": [[["lambda_45", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_62", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_62", "inbound_nodes": [[["activation_52", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_53", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_63", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_63", "inbound_nodes": [[["activation_53", 0, 0, {}]]]}], "input_layers": [["data", 0, 0]], "output_layers": [["conv2d_63", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}